_Rarzrabotki/Kazna/Enums/Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженаВКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплаченоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденПоСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/CommonModules/ПодпискиНаСобытия/Ext/Module.bsl
Функция ПолучитьЗначение(Источник, Поле)
	
	Если Источник=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если ТипЗнч(Источник)=Тип("Структура") И Не Источник.Свойство(Поле) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеИсточника = Источник.Метаданные();
	Если МетаданныеИсточника.Реквизиты.Найти(Поле)=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Источник[Поле];
	
КонецФункции

Процедура ПроверитьДокументОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	МетаданныеОбъекта = Источник.Метаданные();
	//++ Павел Чистяков 10.10.2016 11:11:38 №312
	Если МетаданныеОбъекта.Реквизиты.Найти("Секция")<>Неопределено
		И МетаданныеОбъекта.Реквизиты.Найти("Подразделение")<>Неопределено Тогда
		Если Источник.Подразделение.ДетализацияДоСекций Тогда
			ПроверяемыеРеквизиты.Добавить("Секция");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьВалютаДокументаОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	МетаданныеОбъекта = Источник.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("ВалютаДокумента")<>Неопределено Тогда
		Источник.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Секция")<>Неопределено
		И Не ЗначениеЗаполнено(Источник.Секция) Тогда
		Источник.Секция = ПолучитьЗначение(ДанныеЗаполнения, "Секция");
		Если Не ЗначениеЗаполнено(Источник.Секция) Тогда
			ДокументОснование = ПолучитьЗначение(ДанныеЗаполнения, "ДокументОснование");
			Источник.Секция = ПолучитьЗначение(ДокументОснование, "Секция");
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверкаКорректностиСтатьиДДСПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.дата<Дата(2016,08,01) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	//Сава 2016/08 Разрешим отклонить и черновик
	Если 	Источник.Виза_Состояние.Пустая() 
		ИЛИ Источник.Виза_Состояние = Перечисления.Визы_Состояния.Черновик
		ИЛИ Источник.Виза_Состояние = Перечисления.Визы_Состояния.Анулировано
		ИЛИ Источник.Виза_Состояние = Перечисления.Визы_Состояния.Отклонено тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаСтарыеСтатьи = Константы.АХ_ГруппаСтатейДДСДо20160801.Получить();
	Если ЗначениеЗаполнено(ГруппаСтарыеСтатьи) Тогда
		Если Источник.СтатьяДвиженияДенежныхСредств.ПринадлежитЭлементу(ГруппаСтарыеСтатьи) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрана некорректная статья ДДС", Источник,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ид_УстановкаПрефиксаДокументовПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	// Вставить содержимое обработчика.
	Префикс="N";
КонецПроцедуры

Процедура АХ_ОтменаРегистрацииППИПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Если Источник.НеОтправлятьВБухгалтерию Тогда
		Источник.ОбменДанными.Получатели.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура ИД_ПриУстановкеПрефиксаППИПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	// Вставить содержимое обработчика.
	Префикс="000";
КонецПроцедуры

Процедура ИД_ДозаполнитьРеквизитыБанкДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(Источник.Подразделение) Тогда
		Источник.Подразделение=  ПараметрыСеанса.ТекущийПользователь.Подразделение;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Источник.ВидОперации) Тогда
		Если ТипЗнч(Источник)=Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			Источник.ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
		ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда	
			Источник.ВидОперации=Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаЗаполненностиНаправленияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
	Иначе	
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Дата<Дата(2022,07,01) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("ДокументОбъект.СчетНаОплатуПоставщика")  ИЛИ 
		ТипЗнч(Источник)=Тип("ДокументОбъект.ПлатежноеПоручениеВходящее")  ИЛИ
		ТипЗнч(Источник)=Тип("ДокументОбъект.ПриходныйКассовыйОрдер")		Тогда
		Если НЕ ЗначениеЗаполнено(Источник.Направление) Тогда
			Отказ= Истина ;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.РасходныйКассовыйОрдер")  ИЛИ ТипЗнч(Источник)=Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее")  Тогда
		Если ЗначениеЗаполнено(Источник.ДокументОснование)  Тогда 
			Попытка
				Если ЗначениеЗаполнено(Источник.ДокументОснование.СчетНаОплатуПоставщика) Тогда
					Если  ЗначениеЗаполнено(Источник.ДокументОснование.СчетНаОплатуПоставщика.Направление) Тогда
					Иначе
						Если НЕ ЗначениеЗаполнено(Источник.Направление) Тогда
							Отказ= Истина ;
						КонецЕсли;
						
					КонецЕсли;
				Иначе	
					Если НЕ ЗначениеЗаполнено(Источник.Направление) Тогда
						Отказ= Истина ;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
		Иначе
			Если НЕ ЗначениеЗаполнено(Источник.Направление) Тогда
				Отказ= Истина ;
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Стр Из Источник.Расшифровка Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Направление) Тогда
				Отказ= Истина ;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПроверкаЗаблокированностиКонтрагентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ТипЗнч(Источник)=Тип("ДокументОбъект.СчетНаОплатуПоставщика")  ИЛИ 
		ТипЗнч(Источник)=Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее")  ТОгда
		Если Источник.КОнтрагент.ЗаблокированНалоговойИнспекцией Тогда
		     Отказ= Истина;
			// #Если КЛиент Тогда
			 	Сообщить("Контрагент заблокирован  налоговой инспекцией");
			 //#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры
